docs/notes/dsffap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
    "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">

<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
  <!-- 2022-07-18 Mon 17:57 -->
  <meta http-equiv="Content-Type" content=
  "text/html; charset=us-ascii" />
  <meta name="viewport" content=
  "width=device-width, initial-scale=1" />

  <title>&lrm;</title>
  <meta name="author" content="Philip" />
  <meta name="generator" content="Org Mode" />
</head>

<body>
  <div id="content" class="content">
    <div id="table-of-contents" role="doc-toc">
      <h2>Table of Contents</h2>

      <div id="text-table-of-contents" role="doc-toc">
        <ul>
          <li>
            <a href="#org554b31f">Distributed Systems for Fun and
            Profit</a>

            <ul>
              <li>
                <a href="#orgbc23568">Designing Systems</a>

                <ul>
                  <li><a href="#org08a4043">Nodes</a></li>

                  <li><a href="#orge2f9075">Links</a></li>

                  <li><a href=
                  "#org4d30d37">Timing/Ordering</a></li>

                  <li><a href="#org9a035ad">Consensus
                  Problem</a></li>

                  <li><a href="#org402f8d0">FLP Impossibility
                  Result</a></li>

                  <li><a href="#org51b6a27">The CAP
                  Theorem</a></li>

                  <li><a href="#orgf2e190b">Consistency
                  models</a></li>
                </ul>
              </li>

              <li>
                <a href="#org0f63f52">Time and Order</a>

                <ul>
                  <li><a href="#orgfc8804b">2PC (two phase
                  commit)</a></li>

                  <li><a href="#org2b8c7bf">Partition tolerant
                  consensus algorithms</a></li>
                </ul>
              </li>

              <li>
                <a href="#org143ddc7">Replication: weak consistency
                model protocols</a>

                <ul>
                  <li><a href="#orgcb5b384">Reconciling different
                  operation orders</a></li>

                  <li><a href="#org97e49d7">Amazon&rsquo;s
                  Dynamo</a></li>
                </ul>
              </li>
            </ul>
          </li>
        </ul>
      </div>
    </div>

    <div id="outline-container-org554b31f" class="outline-2">
      <h2 id="org554b31f">Distributed Systems for Fun and
      Profit</h2>

      <div class="outline-text-2" id="text-org554b31f"></div>

      <div id="outline-container-orgbc23568" class="outline-3">
        <h3 id="orgbc23568">Designing Systems</h3>

        <div class="outline-text-3" id="text-orgbc23568">
          <ul class="org-ul">
            <li>Lots of assumptions you can make

              <ul class="org-ul">
                <li>Weak assumptions -&gt; Robust system model</li>

                <li>Strong assumptions -&gt; Easier system to
                reason about/design</li>
              </ul>
            </li>
          </ul>
        </div>

        <div id="outline-container-org08a4043" class="outline-4">
          <h4 id="org08a4043">Nodes</h4>

          <div class="outline-text-4" id="text-org08a4043">
            <ul class="org-ul">
              <li>Can execute code</li>

              <li>Can store data</li>

              <li>Have a clock</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-orge2f9075" class="outline-4">
          <h4 id="orge2f9075">Links</h4>

          <div class="outline-text-4" id="text-orge2f9075">
            <ul class="org-ul">
              <li>Connect Nodes</li>

              <li>Bi-directional</li>

              <li>Nodes or network can fail</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-org4d30d37" class="outline-4">
          <h4 id="org4d30d37">Timing/Ordering</h4>

          <div class="outline-text-4" id="text-org4d30d37">
            <ul class="org-ul">
              <li>Physical distance between nodes slows things
              down</li>

              <li>Messages recieved at different times</li>

              <li>Synchronous vs async

                <ul class="org-ul">
                  <li>Accurate clock vs clocks useless</li>

                  <li>Upper bound on delay vs no bounds on
                  delay</li>

                  <li>Convenient vs</li>

                  <li>Makes lots of assumptions vs few/weak
                  assumptions</li>
                </ul>
              </li>
            </ul>
          </div>
        </div>

        <div id="outline-container-org9a035ad" class="outline-4">
          <h4 id="org9a035ad">Consensus Problem</h4>

          <div class="outline-text-4" id="text-org9a035ad">
            <p>Nodes achieve consensus if they&hellip;</p>

            <ul class="org-ul">
              <li>All agree on a value</li>

              <li>Produce at most one value</li>

              <li>All reach a decision</li>

              <li>If all correct nodes propose a value, then all
              nodes decide that value</li>
            </ul>
          </div>
        </div>

        <div id="outline-container-org402f8d0" class="outline-4">
          <h4 id="org402f8d0">FLP Impossibility Result</h4>

          <div class="outline-text-4" id="text-org402f8d0">
            <p>Examines the consensus problem (agreement
            problem)</p>

            <p>Assumptions:</p>

            <ul class="org-ul">
              <li>Nodes can only fail by crashing</li>

              <li>Network is reliable</li>

              <li>Async system model</li>
            </ul>

            <blockquote>
              <p>There cannot exist a deterministic algorithm for
              the consensus problem in an asynchronous system
              subject to failures, even if messages can never be
              lost, at most one process may fail, and it can only
              fail by crashing.</p>
            </blockquote>

            <p>No way to solve the consensus problem under minimal
            system in a way that cannot be delayed forever. If it
            existed, one could devise and execution of it where it
            remains undecided for arbitrary amount of time by
            delaying the message delivery.</p>
          </div>
        </div>

        <div id="outline-container-org51b6a27" class="outline-4">
          <h4 id="org51b6a27">The CAP Theorem</h4>

          <div class="outline-text-4" id="text-org51b6a27">
            <p>Useful way to think about tradeoffs in the
            guarantees that a system design makes Theorem states
            that only 2/3 of these properties can be satisfied at
            the same time</p>

            <ul class="org-ul">
              <li><b>Consistency</b>: all nodes see the same data
              at the same time</li>

              <li><b>Availability</b>: nodes failures do not
              prevent survivors from continuing to operate</li>

              <li><b>Partition tolerance</b>: The system continues
              to operate desipite message loss due to network
              and/or node failure</li>
            </ul>

            <p>3 types of resulting systems</p>

            <ul class="org-ul">
              <li>CA (consistency + availability)</li>

              <li>CP (consistency + partition tolerance)</li>

              <li>AP (availability + partition tolerance)</li>
            </ul>

            <p>CA and CP both provide <b>strong consistency</b>. AP
            systems can provide <b>eventual consistency</b>.</p>

            <p>CA systems cannot tolerate any node failures. Does
            not distinguish between node and network failure. Only
            safe thing to do is stop accepting writes, otherwise
            you introduce divergence.</p>

            <p>CP systems can tolerate up to <code>f</code> faults,
            given <code>2f+1</code> nodes. CP systems prevent
            divergence by forcing asymmetric behaviour on the two
            sides of the partition.</p>

            <p>CP systems incorporate network partitions into their
            failure model and distringuish between a majority and
            minority partition using an algorithm like paxos, raft
            or viewstamped replication. CA systems are not
            partition-aware, and are more common. They often use
            the two-phase-commit (2PC) algo and are common in
            traditional distributed relational databases.</p>

            <p>Assuming that a partition occurs, the theorem
            reduces to CP and AP.</p>

            <p>4 conclusions that can be drawn here:</p>

            <ul class="org-ul">
              <li>Many early systems didn&rsquo;t take partition
              tolerance into account. It wasn&rsquo;t as important
              because systems are not geographically
              distributed</li>

              <li>There is a tension between strong consistency and
              high availability during network partitions.</li>

              <li>There is a tension between strong consistency and
              performance in normal operation.</li>

              <li>If we do not want to give up availability during
              a network partition, then we need to explore whether
              consistency models other than strong consistency are
              workable for our purpose</li>
            </ul>

            <blockquote>
              <p>For example, even if user data is georeplicated to
              multiple datacenters, and the link between those two
              datacenters is temporarily out of order, in many
              cases we&rsquo;ll still want to allow the user to use
              the website / service. This means reconciling two
              divergent sets of data later on, which is both a
              technical challenge and a business risk. But often
              both the technical challenge and the business risk
              are manageable, and so it is preferable to provide
              high availability.</p>
            </blockquote>

            <p>I believe this is what Nathan&rsquo;s blog post
            about beating CAP theorem relates to - using
            immutability, we can significantly decrease the
            challenge of reconciling divergent sets of data.</p>
          </div>
        </div>

        <div id="outline-container-orgf2e190b" class="outline-4">
          <h4 id="orgf2e190b">Consistency models</h4>

          <div class="outline-text-4" id="text-orgf2e190b">
            <p>The C in CAP refers to <b>strong consistency</b>,
            but that&rsquo;s not the only type of consistency</p>
          </div>

          <ul class="org-ul">
            <li>
              <a id="orgb8a19fa" name="orgb8a19fa"></a>Strong
              consistency models<br />

              <div class="outline-text-6" id="text-orgb8a19fa">
                <p>capable of miantaining a single copy</p>

                <ul class="org-ul">
                  <li>linearizable consistency</li>

                  <li>Seqential consistency</li>
                </ul>
              </div>

              <ul class="org-ul">
                <li>
                  <a id="org7aab265" name=
                  "org7aab265"></a>Linearizable consistency<br />

                  <div class="outline-text-7" id="text-org7aab265">
                    <p>All operations appear to have executed
                    atomically in an order that is consistent with
                    the global real-time ordering of operations</p>
                  </div>
                </li>

                <li>
                  <a id="orga3ace12" name=
                  "orga3ace12"></a>Sequential Consistency<br />

                  <div class="outline-text-7" id="text-orga3ace12">
                    <p>All operations appear to have executed
                    atomically in some order that is consistent
                    with the order seen at individual nodes and
                    that is equal at all nodes</p>

                    <p>Diff is that linearizable requires the order
                    they take effect to be the same as the actual
                    real-time ordering of operations. Sequential
                    consistency requires they&rsquo;re the same
                    across all nodes, even if it differs from the
                    real-time ordering of operations.</p>

                    <p>They are equivalent from the perspective of
                    a client interacting with a node.</p>
                  </div>
                </li>
              </ul>
            </li>

            <li>
              <a id="org9834298" name="org9834298"></a>Weak
              consistency models<br />

              <div class="outline-text-6" id="text-org9834298">
                <p>Not stong</p>

                <ul class="org-ul">
                  <li>Client-centric consistency models</li>

                  <li>Causal consistency: strongest model
                  available</li>

                  <li>Eventual consistency models</li>
                </ul>

                <p>Strong consistency models guarantee that the
                apparent order and visibility of updates is
                equivalent to a non-replicated system. Weak
                consistency models, on the other hand, do not make
                such guarantees. ^^ Again, I believe this is part
                of what Nathan&rsquo;s blog post refers to Hmm, but
                time-stamps aren&rsquo;t necessarily reliable, so
                how is this handled&hellip;?</p>
              </div>

              <ul class="org-ul">
                <li>
                  <a id="orgb7f4df1" name=
                  "orgb7f4df1"></a>Client-centric consistency
                  models<br />

                  <div class="outline-text-7" id="text-orgb7f4df1">
                    <p>Consistency models that involve the nothion
                    of a client or session in some way. Ex, a
                    client-centric consistency model might
                    guarantee that a client will never see older
                    versions of a data item. This is often
                    implemented by building additional caching in
                    to the client lib, so that if a client moves to
                    a replica node that contains old data, then the
                    client lib returns its cached value rather than
                    the old value from the replica.</p>

                    <p>Many typed of client-centric consistency
                    models</p>
                  </div>
                </li>

                <li>
                  <a id="org0419328" name="org0419328"></a>Eventual
                  consistency<br />

                  <div class="outline-text-7" id="text-org0419328">
                    <p>If you stop changing values, after some
                    amount of time, all replicas will agree on the
                    same value.</p>

                    <p>This is a very weak constraint because most
                    useful distributed systems will have eventual
                    consistency.</p>
                  </div>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>

      <div id="outline-container-org0f63f52" class="outline-3">
        <h3 id="org0f63f52">Time and Order</h3>

        <div class="outline-text-3" id="text-org0f63f52"></div>

        <div id="outline-container-orgfc8804b" class="outline-4">
          <h4 id="orgfc8804b">2PC (two phase commit)</h4>

          <div class="outline-text-4" id="text-orgfc8804b">
            <p>assumptions:</p>

            <ul class="org-ul">
              <li>Data in stable storage at each node is never
              lost</li>

              <li>No node crashes forever</li>
            </ul>

            <p>Allows changes to be commited by having each node
            vote on wheter to commit or abort the transaction. In
            P/B systems, there is no step for rolling back an op
            that has failed on some nodes and succeeded on others,
            which causes replicas to potentially diverge.</p>

            <p>Prone to blocking since a single node failure blocks
            until it&rsquo;s recovered.</p>

            <p>Data loss is possible when stable storage is
            corrupted in a crash</p>

            <p>(CA)P - failure models do not include network
            partitions</p>
          </div>
        </div>

        <div id="outline-container-org2b8c7bf" class="outline-4">
          <h4 id="org2b8c7bf">Partition tolerant consensus
          algorithms</h4>

          <div class="outline-text-4" id="text-org2b8c7bf">
            <p>Paxos and Raft algorithms Paxos is the classic
            algol, but it&rsquo;s difficult to explain and
            implement. Raft is much newer and easier.</p>
          </div>

          <ul class="org-ul">
            <li>
              <a id="org2c5a371" name="org2c5a371"></a>What is a
              Network Partition?<br />

              <div class="outline-text-6" id="text-org2c5a371">
                <p>The failure of a network link to one or several
                nodes. The nodes themselves continue to stay
                active, and as such may be able to receive requests
                from clients on their side of the network
                partition.</p>

                <p>Network partitions should also be assumed to
                occur</p>

                <p>Not possible to distinguish between a failed
                remote node, and that node being unreachable. If a
                network partition occurs bu no nodes fail, then the
                system is divided into two partitions which are
                simultaneously active.</p>
              </div>
            </li>
          </ul>
        </div>
      </div>

      <div id="outline-container-org143ddc7" class="outline-3">
        <h3 id="org143ddc7">Replication: weak consistency model
        protocols</h3>

        <div class="outline-text-3" id="text-org143ddc7"></div>

        <div id="outline-container-orgcb5b384" class="outline-4">
          <h4 id="orgcb5b384">Reconciling different operation
          orders</h4>

          <div class="outline-text-4" id="text-orgcb5b384">
            <p>Systems that do not enforce single-copy consistency
            allow replicas to diverge from each other. This means
            that there is not strictly defined pattern of
            communication: replicas can be separated from each
            other and yet continue to be availble and accept
            writes.</p>

            <p><b>single-copy consistency:</b> requires that you
            need to figure out what to do when nodes go down
            <b>weak consistency</b>: requires that you need to
            figure out how to reconcile diverging data</p>

            <p>Ex. 3 replicas partitioned from each other accepting
            writes. They can all see each other again and need to
            converge to the same result:</p>
            <pre class="example">
[A] \
    --&gt; [merge]
[B] /     |
          |
[C] ----[merge]---&gt; result
</pre>

            <p>There is no single total order, so we need to figure
            out how to order shit too.</p>
            <pre class="example">
1: { operation: concat('Hello ') }
2: { operation: concat('World') }
3: { operation: concat('!') }

-&gt; Hello World!
-&gt; World!Hello
-&gt; Hollo !World
...
</pre>

            <p>We want replicas to converge to the same result.</p>
          </div>
        </div>

        <div id="outline-container-org97e49d7" class="outline-4">
          <h4 id="org97e49d7">Amazon&rsquo;s Dynamo</h4>

          <div class="outline-text-4" id="text-org97e49d7">
            <p>Offers weak consistency guarantees, but high
            availability. It is eventually consistent, highly
            available. K/V store.</p>

            <p>Cluster has N peer nodes; each node has set of keys
            it&rsquo;s responsible for storing</p>

            <p>When a key is read, there is a read reconciliation
            phase that attempts to reconcile differences between
            replicas before returning the value back to the
            client.</p>
          </div>

          <ul class="org-ul">
            <li>
              <a id="orgbc6f449" name="orgbc6f449"></a>Consistent
              Hashing<br />

              <div class="outline-text-5" id="text-orgbc6f449">
                <p>Need to locate which node the data lives on.
                Requires key-to-node mapping.</p>

                <p>Keys are mapped to nodes using consistent
                hashing technique. Key can be mapped to a set of
                nodes by a simple calculation on a client. Hashing
                is faster than performing remote procedure
                call.</p>
              </div>
            </li>

            <li><a id="org201e41b" name="org201e41b"></a>Partial
            quorums<br /></li>
          </ul>
        </div>
      </div>
    </div>
  </div>

  <div id="postamble" class="status">
    <p class="author">Author: Philip</p>

    <p class="date">Created: 2022-07-18 Mon 17:57</p>
  </div>
</body>
</html>
